# Pandas Complete Tutorial for Data Science

In [1]:
import numpy as np
import pandas as pd

# Loading Different Data Formats Into A Pandas Data Frame

In [2]:
# Loading data sets
df=pd.read_csv('C:\\Users\\LENOVO\\Desktop\\Pandas\\Datasets\\online_store_customer_data.csv')

In [3]:
df.head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
3,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,NaN,1199.79
4,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN

In [4]:
df.tail()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
2507,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.10
2508,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0,708.88
2509,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0,2030.07
2510,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0,1909.77
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.15

In [5]:
df.head(3)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
0,1/1/2019,151200,Female,19.0,Single,Kansas,Basic,Unemployment,Other,1.0,2051.36
1,1/1/2019,151201,Male,49.0,Single,Illinois,Basic,self-employed,Card,0.0,544.04
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60

In [6]:
df.tail(1)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
2511,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.15

In [7]:
# Loading csv file with skip firts 2 rows without header
df_csv=pd.read_csv('C:\\Users\\LENOVO\\Desktop\\Pandas\\Datasets\\online_store_customer_data.csv',skiprows=2)
df_csv

,1/1/2019,151201,Male,49,Single,Illinois,Basic,self-employed,Card,0,544.04
0,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
1,1/1/2019,151203,NaN,18.0,Single,Virginia,Platinum,workers,Card,NaN,1199.79
2,1/1/2019,151204,Male,27.0,Single,Connecticut,Basic,self-employed,Card,0.0,NaN
3,1/3/2019,151205,Male,71.0,Single,Hawaii,Basic,Employees,PayPal,1.0,2922.66
4,1/3/2019,151206,Female,34.0,Married,New Mexico,Platinum,Employees,PayPal,1.0,1481.42
...,...,...,...,...,...,...,...,...,...,...,...
2505,5/1/2021,153695,Female,57.0,Single,South Carolina,Platinum,self-employed,Card,0.0,150.10
2506,5/1/2021,153696,Female,36.0,Married,Hawaii,Silver,self-employed,PayPal,1.0,708.88
2507,5/1/2021,153697,Male,22.0,Single,South Carolina,Basic,workers,PayPal,1.0,2030.07
2508,5/1/2021,153698,NaN,44.0,Single,New York,Basic,Employees,PayPal,0.0,1909.77
2509,5/1/2021,153699,Male,48.0,Single,California,Silver,workers,PayPal,1.0,1073.15

# Read csv file from URL

In [8]:
# Read csv file from url
url="https://archive.ics.uci.edu/ml/machine-learning-databases/iris/iris.data"
df_url=pd.read_csv(url)
df_url

URLError: <urlopen error [Errno 11001] getaddrinfo failed>

In [ ]:

pip install ucimlrepo

from ucimlrepo import fetch_ucirepo 
  
# fetch dataset 
heart_disease = fetch_ucirepo(id=45) 
  
# data (as pandas dataframes) 
X = heart_disease.data.features 
y = heart_disease.data.targets 
  
# metadata 
print(heart_disease.metadata) 
  
# variable information 
print(heart_disease.variables)

In [ ]:
from ucimlrepo import fetch_ucirepo 
  
# fetch dataset 
heart_disease = fetch_ucirepo(id=45) 
  
# data (as pandas dataframes) 
X = heart_disease.data.features 
y = heart_disease.data.targets 
  
# metadata 
print(heart_disease.metadata) 
  
# variable information 
print(heart_disease.variables)

# Read text file

In [ ]:
df_txt = pd.read_csv("C:\\Users\\LENOVO\\Desktop\\Pandas\\Datasets\\demo_text (1).txt")
df_txt

In [ ]:
df_txt = pd.read_csv("C:\\advance java\\ana.txt")
df_txt

## Read excel files

In [ ]:
df_excel = pd.read_excel('C:\\Users\\LENOVO\\Desktop\\Pandas\\Datasets\\excel_file (3).xlsx')
df_excel

# 3. Data Preprocessing

### Data preprocessing is the process of making raw data to clean data.This is the most crucial part of data science.Int this section , we will explore data first then we remove unwanted columns,remove duplicates,handle missing data etc. After this step,we get clean data from raw data.

## 3.1 Data Exploring

## Retriving rows from data frames

In [ ]:
# Display first 6 rows 
df.head(6)

In [ ]:
# Display last 6 rows
df.tail(6)

df.sample(6)

In [ ]:
df.sample()

## Retrieving information about dataframe

In [ ]:
df.info()

In [ ]:
# Display datatype
df.dtypes

In [ ]:
df.dtypes.value_counts()

## Display no of rows and columns

In [ ]:
df.shape

In [ ]:
df.columns

In [ ]:
# Display age of columns first 3 rows
df['Age'].head(3)

In [ ]:
df_excel.shape

In [ ]:
# Display first 4 rows of Age,Transaction_date and Gender columns
df[['Age','Transaction_date','Gender']].head(4)

# Retrieving a Range of Rows

In [ ]:
# for display 2nd to 6th rows
df[2:7]

In [ ]:
# for display staring to 10th
df[:11]

In [ ]:
# for display last two rows
df[-2:]

# 3.2 Data Cleaning

### After the explore our datasets may used to clean them for better analysis. Data coming from multiple source so it's possible to have an error in some value. This is where data cleaning becomes extremely important. In this section, we wiil delete unwanted columns,rename columns,correct appropriate data type etc.

## Delete column name

In [ ]:
# Drop unwanted column
df.drop(['Transaction_ID'],axis=1,inplace=True)

In [ ]:
df

In [ ]:
# Change column name...


# create new df_col dataframe from df.copy () method
df_col = df.copy()
df_col

In [ ]:
# rename columns name
df_col.rename(columns={"Transaction_date":"Date","Gender":"Sex"},inplace=True)
df_col.head(3)

## Adding a new column to a dataframe

In [ ]:
# add a new adjusted column which value will be amount_spent + 10
df_col['new_col'] = df_col['Amount_spent'] * 10

In [ ]:
df_col

## String value change or replace

In [ ]:
df_col.head(3)

In [ ]:
# changing female to woman and male to man in c]sex column 
# first agrument in loc function is condition and second one is columns name.
df_col.loc[df_col.Sex == "Female",'Sex'] = 'Woman'
df_col.loc[df_col.Sex == "Male",'Sex'] = 'Man'

In [ ]:
df_col

## Datatypes change

In [ ]:
df_col.info()

##In our date columns, its object type so now we will convert this to date types,and also we will convert Referal columns float64 to float32

In [ ]:
# Change object type to dataframe64 format
df_col['Date'].astype('datetime64[ns]')

In [ ]:
# change float64 to float32 of Referal columns
df_col['Referal'] = df_col['Referal'].astype('float32')

In [ ]:
df_col.info()

## Remove duplicate

In [ ]:
# Display duplicated entries
df_col.duplicated().sum()

In [ ]:
# duplicate rows display , keeparguments will---- 'first','last'and false 
duplicate_value = df.duplicated(keep='first')
duplicate_value
 #df.loc[duplicated_value,:]

In [ ]:
# Droppingall duplicate values
df.drop_duplicates(keep = 'first',inplace = True)
df.drop_duplicates()

## Handling missing values

### Handling missing values in the comman task in the data pre-processing part. For many reasons most of the time we will encounter missing values. Without dealing with this we cant't do the proper model building. For this section first we will find out missing values then we decided how to handle them. We can handle this by removing affectd columns or rows or replacing appropriate value there.

## Display missing values information

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('C:\\Users\\LENOVO\\Desktop\\Pandas\\Datasets\\online_store_customer_data.csv')
df.head(10)

In [ ]:
df.isna().sum().sort_values(ascending=False)

In [ ]:
df

## Delete Nan rows

### If we have less nan value then we can delete entire rows by dropna() function. For this function,we will add columns name in subset parameter.

In [ ]:
# df copy to df_copy
df_new = df.copy()

In [ ]:
df_new

In [ ]:
# Delete Nan rows of Employee_status columns 
df_new.dropna(subset = ["Employees_status"], inplace=True)
df_new

In [ ]:
df_new

# Delete entire coulmns

In [ ]:
df_new.dropna(subset=['Segment'], inplace=True)
df_new

In [ ]:
df_new.isna().sum().sort_values(ascending=False)

## Immute missing values

In [ ]:
df_new.info()

### Sometimes if we delete entire columns that will be not the appropriate approach. Delete columns can affect our model building because we will lose our  main features. For imputing wenhave many approaches to here are ome of the most popular technique.

### Method 1: Impute fixed value like 0,'Unknown ' or 'Missing 'etc.We impute Unknown in Gender columns.

In [ ]:
df

In [ ]:
df['Gender'].fillna('Unknown',inplace=True)

In [ ]:
df

### Method 2: Impute Mean,median and mode

In [ ]:
df_new

In [ ]:
df

In [ ]:
# Impute Mean in Amount_spent columns
mean_Amount_spent = df['Amount_spent'].mean()
df['Amount_spent'].fillna(mean_Amount_spent, inplace=True)
df
mean_Amount_spent

In [ ]:
# Impute Median in Age column
median_Age = df['Age'].median()
df['Age'].fillna(median_Age, inplace=True)
df
median_Age

In [ ]:
# Impute Mode in Employees_status columns
mode_emp = df['Employees_status'].mode().iloc[0]
df['Employees_status'].fillna(mode_emp, inplace=True)
df
mode_emp

In [ ]:
mean_Amount_spent

In [ ]:
median_Age

In [ ]:
mode_emp

#### Method 3 : Imputing forward fill or backfill by ffill and bfill.In ffill missing value impute from the values of the above row and for bfill it;s taken from the below rows value.

In [ ]:
df

In [ ]:
df['Referal'].fillna(method='ffill', inplace=True)
df

In [ ]:
df.isna().sum().sum()

In [ ]:
df.isna().sum().sort_values(ascending=False)

## Memoey management

### When we work on large datasets ,there we get one big issue is a memory problem. We need to large resources for dealing with this. But there are some methods in pandas to deal with this.Here are some methods or strategies to deal with this problems with the help of pandas.

In [ ]:
df_memory=df.copy()

In [ ]:
df_memory

In [ ]:
memory_usage=df_memory.memory_usage(deep=True)
memory_usage_in_mbs=round(np.sum(memory_usage)/1024**2,3)
print(f"Total memory taking df_memory dattaframe is:{memory_usage_in_mbs:.2f} MB")

## Change object to category datatypes

Our data frame is small in size. Which is 1.15 MB .Now we will convert our object datatype to category

In [ ]:
# Object datatype to category convert
df_memory[df_memory.select_dtypes(['object']).columns]=df_memory.select_dtypes(['object']).apply(lambda x: x.astype('category'))
df_memory

In [ ]:
# convert object to category
df_memory.info(memory_usage="deep")

## Change int64 or float64 to int 32,16,8

By default pandas store numeric values to int64 or float64.Which takes more memory.If we have to store small numbers then we can change to 64 to 32,16 and so on.For example,our Referal columns have only 0 and 1 values so for that we don't need to store at float64.so now we change it to float16.

In [ ]:
# change referal column datatype
df_memory['Referal']=df_memory['Referal'].astype('float32')

## Data Analysis

### 5.1 Calculating Basic Statistical measurment

In [9]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
Transaction_ID,2512.0,152443.931131,724.580482,151200.00,151815.7500,152443.500,153071.2500,153699.00
Age,2470.0,46.637652,18.186277,15.00,32.0000,47.000,62.0000,78.00
Referal,2356.0,0.651952,0.476452,0.00,0.0000,1.000,1.0000,1.00
Amount_spent,2270.0,1418.422577,878.507451,2.09,678.1925,1341.435,2038.1025,2999.98

We know already above code will display only numeric columns basic statistical information for object or category columns we can use describe(include=object)

In [12]:
df.describe(include=object).T

                 count unique        top  freq
Transaction_date  2512    810  8/29/2020    12
Gender            2484      2     Female  1356
Marital_status    2512      2    Married  1473
State_names       2512     50   Illinois    67
Segment           2512      5      Basic  1136
Employees_status  2486      4  Employees   946
Payment_method    2512      3     PayPal  1168

We can calculate the mean ,mode,median , max value,min value of individual columns we simply use these function.

In [13]:
# calculate standard deviation
std=df['Age'].std()

# calculate  min value
minimum=df['Age'].min()

# calculate max value
maximum=df.Age.max()

print(f"Standard deviation of Age:{std:.2f}")
print(f"Manimum value of Age:{minimum}")
print(f"Maximum value of Age:{maximum}")

Standard deviation of Age:18.19
Manimum value of Age:15.0
Maximum value of Age:78.0

In pandas we can display the correlation of different numeric columns for this we can use corr() function

In [ ]:
# calculate correation
df.corr()

## 5.2 Basic built in function for data analysis

##### Number of unique values in category column

In [15]:
# for display how many unique values are there in State_names columns
df['State_names'].nunique()

50

## counts of unique values

In [ ]:
df['State_names'].value_counts()

If we want to show with the percentage of occurrence rather number than we use normalize=True argument in value_counts() function.

In [17]:
# calculate percentage of each category
df['State_names'].value_counts(normalize=True)

State_names
Illinois          0.026672
Georgia           0.025478
Massachusetts     0.025080
Maine             0.024682
Kentucky          0.023487
Minnesota         0.023487
Missouri          0.022691
Arizona           0.022293
Delaware          0.022293
Arkansas          0.021895
Nevada            0.021895
New York          0.021895
California        0.021895
New Mexico        0.021895
Vermont           0.021497
West Virginia     0.021497
New Jersey        0.021099
Oregon            0.021099
Florida           0.021099
Connecticut       0.020701
Washington        0.020701
Pennsylvania      0.020701
Colorado          0.020701
South Dakota      0.020701
Michigan          0.020701
Iowa              0.020303
Rhode Island      0.020303
Louisiana         0.019506
Texas             0.019506
Montana           0.019108
North Carolina    0.018312
Virginia          0.018312
Hawaii            0.018312
Wisconsin         0.017914
Idaho             0.017914
Maryland          0.017914
South Carolina    0.017914
Wyoming           0.017516
Mississippi       0.017516
Oklahoma          0.017516
Utah              0.017118
New Hampshire     0.017118
Indiana           0.017118
Ohio              0.017118
Alabama           0.016720
Alaska            0.016322
Nebraska          0.016322
North Dakota      0.016322
Kansas            0.016322
Tennessee         0.015525
Name: proportion, dtype: float64

In [18]:
# ascending values
df['State_names'].value_counts().sort_values(ascending=False).head(20)

State_names
Illinois         67
Georgia          64
Massachusetts    63
Maine            62
Kentucky         59
Minnesota        59
Missouri         57
Arizona          56
Delaware         56
New York         55
California       55
New Mexico       55
Nevada           55
Arkansas         55
West Virginia    54
Vermont          54
New Jersey       53
Oregon           53
Florida          53
Connecticut      52
Name: count, dtype: int64

In [22]:
# sort values Amount_spent with ascending order
df.sort_values(by=['Amount_spent'],ascending=True).head(5)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
2468,4/18/2021,153656,Female,73.0,Married,Michigan,Gold,Employees,PayPal,1.0,2.09
568,7/4/2019,151756,Male,46.0,Single,South Carolina,Gold,workers,PayPal,0.0,2.16
2401,3/25/2021,153589,Female,60.0,Single,Maryland,Silver,Employees,PayPal,1.0,2.84
962,11/13/2019,152150,Female,56.0,Married,Nevada,Basic,workers,Other,1.0,5.31
860,10/10/2019,152048,Male,26.0,Single,Maryland,Silver,Unemployment,PayPal,1.0,5.55

In [28]:
# sort values Amount_spent with descending order
df.sort_values(by=['Amount_spent'],ascending=False).head(5)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
17,1/7/2019,151217,Female,77.0,Married,New Mexico,Platinum,workers,Card,0.0,2999.98
485,6/7/2019,151673,Male,65.0,Married,Arizona,Gold,self-employed,PayPal,1.0,2998.62
2279,2/15/2021,153467,Female,78.0,Single,Arizona,Silver,Employees,PayPal,1.0,2997.21
589,7/13/2019,151777,Male,51.0,Single,North Carolina,Missing,Employees,PayPal,1.0,2997.15
743,8/30/2019,151931,Male,44.0,Single,Illinois,Basic,Employees,Card,1.0,2996.82

In [24]:
# nlargest
df.nlargest(4,'Amount_spent').head(3)

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
17,1/7/2019,151217,Female,77.0,Married,New Mexico,Platinum,workers,Card,0.0,2999.98
485,6/7/2019,151673,Male,65.0,Married,Arizona,Gold,self-employed,PayPal,1.0,2998.62
2279,2/15/2021,153467,Female,78.0,Single,Arizona,Silver,Employees,PayPal,1.0,2997.21

In [27]:
# nsmallest
df.nsmallest(4,'Amount_spent').head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
2468,4/18/2021,153656,Female,73.0,Married,Michigan,Gold,Employees,PayPal,1.0,2.09
568,7/4/2019,151756,Male,46.0,Single,South Carolina,Gold,workers,PayPal,0.0,2.16
2401,3/25/2021,153589,Female,60.0,Single,Maryland,Silver,Employees,PayPal,1.0,2.84
962,11/13/2019,152150,Female,56.0,Married,Nevada,Basic,workers,Other,1.0,5.31

## Conditional queries on Data

In [29]:
# filtering Only show Paypal users
condition=df['Payment_method']=='PayPal'
df[condition].head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
2,1/1/2019,151202,Male,63.0,Married,New Mexico,Basic,workers,PayPal,1.0,1572.60
5,1/3/2019,151205,Male,71.0,Single,Hawaii,Basic,Employees,PayPal,1.0,2922.66
6,1/3/2019,151206,Female,34.0,Married,New Mexico,Platinum,Employees,PayPal,1.0,1481.42
7,1/3/2019,151207,Male,37.0,Married,Connecticut,Basic,workers,PayPal,1.0,1149.55
10,1/4/2019,151210,Female,56.0,Married,California,Basic,Employees,PayPal,0.0,1712.82

In [30]:
# filtering Only show Paypal users
condition=df['Age']=='PayPal'
df[condition].head()

Empty DataFrame
Columns: [Transaction_date, Transaction_ID, Gender, Age, Marital_status, State_names, Segment, Employees_status, Payment_method, Referal, Amount_spent]
Index: []

We can apply multiple conditional queries like before. Foe example,if we want to display all maried female people who lived in New York then use the following

In [31]:
# first create 3 condition
female_person=df['Gender']=='Female'
married_person=df['Marital_status']=='Married'
loc_newyork=df['State_names']=='New York'

# we passing condition on our dataframe
df[female_person & married_person & loc_newyork].head()

,Transaction_date,Transaction_ID,Gender,Age,Marital_status,State_names,Segment,Employees_status,Payment_method,Referal,Amount_spent
164,3/1/2019,151352,Female,64.0,Married,New York,Basic,Employees,PayPal,1.0,1581.77
180,3/7/2019,151368,Female,20.0,Married,New York,Basic,workers,PayPal,NaN,2694.20
254,3/31/2019,151442,Female,78.0,Married,New York,Missing,Employees,PayPal,NaN,2959.54
282,4/8/2019,151470,Female,32.0,Married,New York,Gold,Unemployment,Other,NaN,522.24
827,9/30/2019,152015,Female,77.0,Married,New York,Platinum,workers,Card,1.0,NaN

## Sumarizing or grouping data

Groupby



Grouping by one column: For example, If we want to find maximum values of Age and Amount_spent by Gender then we can use this:

In [32]:
df[['Age','Amount_spent']].groupby(df['Gender']).max()

         Age  Amount_spent
Gender
Female  78.0       2999.98
Male    78.0       2998.62

To find mean,count,and max values of Age and amount_spent by Gender then we cann use agg() function with groupby().

In [36]:
# group by one column
state_gender_res=df[['Age','Gender','Amount_spent']].groupby(['Gender']).agg(['count','mean','max'])
state_gender_res

         Age                  Amount_spent
       count       mean   max        count         mean      max
Gender
Female  1326  46.864253  78.0         1217  1429.031627  2999.98
Male    1116  46.475806  78.0         1027  1407.716397  2998.62

Grouping by multiple columns : To find total count, max and min values of Amount_spent ny State_names,Gender and Payment_method then we can pass these columns names under groupby() function and add.agg() with count ,mean, max argument.

In [43]:
# group by multiple columns
state_gender_res=df[['State_names','Gender','Payment_method','Amount_spent']].groupby(['State_names','Gender','Payment_method']).agg(['count','min','max'])
state_gender_res.head(12)

                                  Amount_spent
                                         count      min      max
State_names Gender Payment_method
Alabama     Female Card                      6   413.11  2749.37
                   Other                     5   851.25  2789.52
                   PayPal                    5    77.90  2520.85
            Male   Card                      6   221.17  2735.65
                   Other                     3   459.47  1691.62
                   PayPal                   10    87.88  2876.36
Alaska      Female Card                      6   141.50  1988.38
                   Other                     7   489.16  2970.00
                   PayPal                    8   462.96  2615.89
            Male   Card                      1  2497.31  2497.31
                   Other                     8   588.88  2977.82
                   PayPal                    8    91.32  1834.95

## Cross Tabulation

For creating a simple crosstab between Maritatal_status and Payment_method columns we just use crosstab() with both columns names

In [44]:
pd.crosstab(df.Payment_method,df.Gender)

Gender          Female  Male
Payment_method
Card               429   310
Other              313   276
PayPal             614   542

In [47]:
pd.crosstab(df.Marital_status,df.Payment_method,margins=True,margins_name="Total")

Payment_method  Card  Other  PayPal  Total
Marital_status
Married          441    362     670   1473
Single           308    233     498   1039
Total            749    595    1168   2512

In [48]:
pd.crosstab(df.Marital_status,df.Payment_method,normalize=True,margins=True,margins_name="Total")

Payment_method      Card     Other    PayPal     Total
Marital_status
Married         0.175557  0.144108  0.266720  0.586385
Single          0.122611  0.092755  0.198248  0.413615
Total           0.298169  0.236863  0.464968  1.000000

In [49]:
pd.crosstab(df.Marital_status,[df.Payment_method,df.Employees_status])

Payment_method        Card                                        Other  \
Employees_status Employees Unemployment self-employed workers Employees
Marital_status
Married                179           38            81     136       127
Single                 115           37            57      96        95

Payment_method                                         PayPal               \
Employees_status Unemployment self-employed workers Employees Unemployment
Marital_status
Married                    41            79     114       260           67
Single                     17            44      76       170           55

Payment_method
Employees_status self-employed workers
Marital_status
Married                    120     217
Single                     106     159